In [2]:
import pandas as pd

In [22]:
people = {'first_name':['Jason','Tony','John'], 'last_name':['Bourne','Stark','Wick'],'email':['bourne.jason@yahoo.com','stark.tony@gmail.com','wick.john@apple.com']}

In [23]:
people

{'first_name': ['Jason', 'Tony', 'John'],
 'last_name': ['Bourne', 'Stark', 'Wick'],
 'email': ['bourne.jason@yahoo.com',
  'stark.tony@gmail.com',
  'wick.john@apple.com']}

In [24]:
df = pd.DataFrame(data=people, columns=['first_name','last_name','email'])
df

  first_name last_name                   email
0      Jason    Bourne  bourne.jason@yahoo.com
1       Tony     Stark    stark.tony@gmail.com
2       John      Wick     wick.john@apple.com

In [26]:
df.first_name

0    Jason
1     Tony
2     John
Name: first_name, dtype: object

In [27]:
df['email']

0    bourne.jason@yahoo.com
1      stark.tony@gmail.com
2       wick.john@apple.com
Name: email, dtype: object

In [30]:
df[['first_name','last_name']]

  first_name last_name
0      Jason    Bourne
1       Tony     Stark
2       John      Wick

In [31]:
df.columns

Index(['first_name', 'last_name', 'email'], dtype='object')

In [39]:
df.columns.to_list()[0:2]

['first_name', 'last_name']

In [52]:
df.set_index('first_name',inplace=True)
df

           last_name                   email
first_name
Jason         Bourne  bourne.jason@yahoo.com
Tony           Stark    stark.tony@gmail.com
John            Wick     wick.john@apple.com

In [53]:
df.reset_index(inplace=True)
df

  first_name last_name                   email
0      Jason    Bourne  bourne.jason@yahoo.com
1       Tony     Stark    stark.tony@gmail.com
2       John      Wick     wick.john@apple.com

In [58]:
df.loc[0]

first_name                     Jason
last_name                     Bourne
email         bourne.jason@yahoo.com
Name: 0, dtype: object

In [56]:
df.iloc[0]

first_name                     Jason
last_name                     Bourne
email         bourne.jason@yahoo.com
Name: 0, dtype: object

In [59]:
df.set_index('first_name',inplace=True)
df

           last_name                   email
first_name
Jason         Bourne  bourne.jason@yahoo.com
Tony           Stark    stark.tony@gmail.com
John            Wick     wick.john@apple.com

In [80]:
df.loc[['Tony','John'],'email']

first_name
Tony    stark.tony@gmail.com
John     wick.john@apple.com
Name: email, dtype: object

In [78]:
df.iloc[[0,1],1]

first_name
Jason    bourne.jason@yahoo.com
Tony       stark.tony@gmail.com
Name: email, dtype: object

In [83]:
df.reset_index(inplace=True)

In [85]:
# slicing
df

  first_name last_name                   email
0      Jason    Bourne  bourne.jason@yahoo.com
1       Tony     Stark    stark.tony@gmail.com
2       John      Wick     wick.john@apple.com

In [93]:
df.loc[0:2]  # last number is inclusive means 0, 1, 2nd row

  first_name last_name                   email
0      Jason    Bourne  bourne.jason@yahoo.com
1       Tony     Stark    stark.tony@gmail.com
2       John      Wick     wick.john@apple.com

In [92]:
df.iloc[0:2] # last number is exclusive means 0, 1st row

  first_name last_name                   email
0      Jason    Bourne  bourne.jason@yahoo.com
1       Tony     Stark    stark.tony@gmail.com

In [97]:
df.loc[0:2,'first_name':'email']

  first_name last_name                   email
0      Jason    Bourne  bourne.jason@yahoo.com
1       Tony     Stark    stark.tony@gmail.com
2       John      Wick     wick.john@apple.com

In [100]:
df.iloc[0:2,0:1]

  first_name
0      Jason
1       Tony

In [3]:
df1 = pd.read_csv(r'C:\Users\prabh\OneDrive\Documents\Lambton\Semester 2\Data Mining and Anaysis\stack-overflow-developer-survey-2022\survey_results_public.csv')
df1.shape

(73268, 79)

In [105]:
df1.head(2)

,ResponseId,MainBranch,Employment,RemoteWork,CodingActivities,EdLevel,LearnCode,LearnCodeOnline,LearnCodeCoursesCert,YearsCode,...,TimeSearching,TimeAnswering,Onboarding,ProfessionalTech,TrueFalse_1,TrueFalse_2,TrueFalse_3,SurveyLength,SurveyEase,ConvertedCompYearly
0,1,None of these,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,I am a developer by profession,"Employed, full-time",Fully remote,Hobby;Contribute to open-source projects,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Too long,Difficult,NaN

In [107]:
df1.tail(2)

,ResponseId,MainBranch,Employment,RemoteWork,CodingActivities,EdLevel,LearnCode,LearnCodeOnline,LearnCodeCoursesCert,YearsCode,...,TimeSearching,TimeAnswering,Onboarding,ProfessionalTech,TrueFalse_1,TrueFalse_2,TrueFalse_3,SurveyLength,SurveyEase,ConvertedCompYearly
73266,73267,I am a developer by profession,"Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;On the job training,NaN,NaN,50,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Easy,NaN
73267,73268,"I used to be a developer by profession, but no...","Independent contractor, freelancer, or self-em...",Fully remote,Hobby;Contribute to open-source projects;Boots...,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",Books / Physical media;Friend or family member...,Technical documentation;Blogs;Programming Game...,Udemy;Pluralsight,16,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Easy,NaN

In [109]:
df1.columns

Index(['ResponseId', 'MainBranch', 'Employment', 'RemoteWork',
       'CodingActivities', 'EdLevel', 'LearnCode', 'LearnCodeOnline',
       'LearnCodeCoursesCert', 'YearsCode', 'YearsCodePro', 'DevType',
       'OrgSize', 'PurchaseInfluence', 'BuyNewTool', 'Country', 'Currency',
       'CompTotal', 'CompFreq', 'LanguageHaveWorkedWith',
       'LanguageWantToWorkWith', 'DatabaseHaveWorkedWith',
       'DatabaseWantToWorkWith', 'PlatformHaveWorkedWith',
       'PlatformWantToWorkWith', 'WebframeHaveWorkedWith',
       'WebframeWantToWorkWith', 'MiscTechHaveWorkedWith',
       'MiscTechWantToWorkWith', 'ToolsTechHaveWorkedWith',
       'ToolsTechWantToWorkWith', 'NEWCollabToolsHaveWorkedWith',
       'NEWCollabToolsWantToWorkWith', 'OpSysProfessional use',
       'OpSysPersonal use', 'VersionControlSystem', 'VCInteraction',
       'VCHostingPersonal use', 'VCHostingProfessional use',
       'OfficeStackAsyncHaveWorkedWith', 'OfficeStackAsyncWantToWorkWith',
       'OfficeStackSyncHaveWorkedWith', 'OfficeStackSyncWantToWorkWith',
       'Blockchain', 'NEWSOSites', 'SOVisitFreq', 'SOAccount', 'SOPartFreq',
       'SOComm', 'Age', 'Gender', 'Trans', 'Sexuality', 'Ethnicity',
       'Accessibility', 'MentalHealth', 'TBranch', 'ICorPM', 'WorkExp',
       'Knowledge_1', 'Knowledge_2', 'Knowledge_3', 'Knowledge_4',
       'Knowledge_5', 'Knowledge_6', 'Knowledge_7', 'Frequency_1',
       'Frequency_2', 'Frequency_3', 'TimeSearching', 'TimeAnswering',
       'Onboarding', 'ProfessionalTech', 'TrueFalse_1', 'TrueFalse_2',
       'TrueFalse_3', 'SurveyLength', 'SurveyEase', 'ConvertedCompYearly'],
      dtype='object')

In [112]:
for i in df1.columns:
    print(i)

ResponseId
MainBranch
Employment
RemoteWork
CodingActivities
EdLevel
LearnCode
LearnCodeOnline
LearnCodeCoursesCert
YearsCode
YearsCodePro
DevType
OrgSize
PurchaseInfluence
BuyNewTool
Country
Currency
CompTotal
CompFreq
LanguageHaveWorkedWith
LanguageWantToWorkWith
DatabaseHaveWorkedWith
DatabaseWantToWorkWith
PlatformHaveWorkedWith
PlatformWantToWorkWith
WebframeHaveWorkedWith
WebframeWantToWorkWith
MiscTechHaveWorkedWith
MiscTechWantToWorkWith
ToolsTechHaveWorkedWith
ToolsTechWantToWorkWith
NEWCollabToolsHaveWorkedWith
NEWCollabToolsWantToWorkWith
OpSysProfessional use
OpSysPersonal use
VersionControlSystem
VCInteraction
VCHostingPersonal use
VCHostingProfessional use
OfficeStackAsyncHaveWorkedWith
OfficeStackAsyncWantToWorkWith
OfficeStackSyncHaveWorkedWith
OfficeStackSyncWantToWorkWith
Blockchain
NEWSOSites
SOVisitFreq
SOAccount
SOPartFreq
SOComm
Age
Gender
Trans
Sexuality
Ethnicity
Accessibility
MentalHealth
TBranch
ICorPM
WorkExp
Knowledge_1
Knowledge_2
Knowledge_3
Knowledge_4
Knowledge_5
Knowledge_6
Knowledge_7
Frequency_1
Frequency_2
Frequency_3
TimeSearching
TimeAnswering
Onboarding
ProfessionalTech
TrueFalse_1
TrueFalse_2
TrueFalse_3
SurveyLength
SurveyEase
ConvertedCompYearly

In [114]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73268 entries, 0 to 73267
Data columns (total 79 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   ResponseId                      73268 non-null  int64
 1   MainBranch                      73268 non-null  object
 2   Employment                      71709 non-null  object
 3   RemoteWork                      58958 non-null  object
 4   CodingActivities                58899 non-null  object
 5   EdLevel                         71571 non-null  object
 6   LearnCode                       71580 non-null  object
 7   LearnCodeOnline                 50685 non-null  object
 8   LearnCodeCoursesCert            29389 non-null  object
 9   YearsCode                       71331 non-null  object
 10  YearsCodePro                    51833 non-null  object
 11  DevType                         61302 non-null  object
 12  OrgSize                         51039 non-null  object
 13  PurchaseInfluence               50969 non-null  object
 14  BuyNewTool                      67963 non-null  object
 15  Country                         71771 non-null  object
 16  Currency                        51264 non-null  object
 17  CompTotal                       38422 non-null  float64
 18  CompFreq                        44425 non-null  object
 19  LanguageHaveWorkedWith          70975 non-null  object
 20  LanguageWantToWorkWith          67027 non-null  object
 21  DatabaseHaveWorkedWith          60121 non-null  object
 22  DatabaseWantToWorkWith          51014 non-null  object
 23  PlatformHaveWorkedWith          49924 non-null  object
 24  PlatformWantToWorkWith          40415 non-null  object
 25  WebframeHaveWorkedWith          53544 non-null  object
 26  WebframeWantToWorkWith          46122 non-null  object
 27  MiscTechHaveWorkedWith          44992 non-null  object
 28  MiscTechWantToWorkWith          36810 non-null  object
 29  ToolsTechHaveWorkedWith         54171 non-null  object
 30  ToolsTechWantToWorkWith         46566 non-null  object
 31  NEWCollabToolsHaveWorkedWith    70347 non-null  object
 32  NEWCollabToolsWantToWorkWith    64108 non-null  object
 33  OpSysProfessional use           65503 non-null  object
 34  OpSysPersonal use               70963 non-null  object
 35  VersionControlSystem            71379 non-null  object
 36  VCInteraction                   68156 non-null  object
 37  VCHostingPersonal use           0 non-null      float64
 38  VCHostingProfessional use       0 non-null      float64
 39  OfficeStackAsyncHaveWorkedWith  46223 non-null  object
 40  OfficeStackAsyncWantToWorkWith  32072 non-null  object
 41  OfficeStackSyncHaveWorkedWith   62128 non-null  object
 42  OfficeStackSyncWantToWorkWith   47688 non-null  object
 43  Blockchain                      71071 non-null  object
 44  NEWSOSites                      71365 non-null  object
 45  SOVisitFreq                     70961 non-null  object
 46  SOAccount                       71572 non-null  object
 47  SOPartFreq                      58229 non-null  object
 48  SOComm                          71408 non-null  object
 49  Age                             70946 non-null  object
 50  Gender                          70853 non-null  object
 51  Trans                           70315 non-null  object
 52  Sexuality                       66565 non-null  object
 53  Ethnicity                       69474 non-null  object
 54  Accessibility                   67244 non-null  object
 55  MentalHealth                    66447 non-null  object
 56  TBranch                         52670 non-null  object
 57  ICorPM                          36283 non-null  object
 58  WorkExp                         36769 non-null  float64
 59  Knowledge_1                     35804 non-null  object
 60  Knowledge_2                     34973 non-null  object
 61  Knowledge_3                     35133 non-null  object
 62  Knowledge_4                     35097 non-null  object
 63  Knowledge_5                     35014 non-null  object
 64  Knowledge_6                     34991 non-null  object
 65  Knowledge_7                     34977 non-null  object
 66  Frequency_1                     35371 non-null  object
 67  Frequency_2                     35344 non-null  object
 68  Frequency_3                     34515 non-null  object
 69  TimeSearching                   36198 non-null  object
 70  TimeAnswering                   36022 non-null  object
 71  Onboarding                      35679 non-null  object
 72  ProfessionalTech                34906 non-null  object
 73  TrueFalse_1                     35819 non-null  object
 74  TrueFalse_2                     35715 non-null  object
 75  TrueFalse_3                     35749 non-null  object
 76  SurveyLength                    70444 non-null  object
 77  SurveyEase                      70508 non-null  object
 78  ConvertedCompYearly             38071 non-null  float64
dtypes: float64(5), int64(1), object(73)
memory usage: 44.2+ MB

In [117]:
import numpy as np
numeric_data = df1.select_dtypes(include=[np.number])
categorical_data = df1.select_dtypes(exclude=[np.number])

In [119]:
numeric_data.shape

(73268, 6)

In [120]:
categorical_data.shape

(73268, 73)

In [121]:
numeric_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73268 entries, 0 to 73267
Data columns (total 6 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   ResponseId                 73268 non-null  int64
 1   CompTotal                  38422 non-null  float64
 2   VCHostingPersonal use      0 non-null      float64
 3   VCHostingProfessional use  0 non-null      float64
 4   WorkExp                    36769 non-null  float64
 5   ConvertedCompYearly        38071 non-null  float64
dtypes: float64(5), int64(1)
memory usage: 3.4 MB

In [122]:
categorical_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73268 entries, 0 to 73267
Data columns (total 73 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   MainBranch                      73268 non-null  object
 1   Employment                      71709 non-null  object
 2   RemoteWork                      58958 non-null  object
 3   CodingActivities                58899 non-null  object
 4   EdLevel                         71571 non-null  object
 5   LearnCode                       71580 non-null  object
 6   LearnCodeOnline                 50685 non-null  object
 7   LearnCodeCoursesCert            29389 non-null  object
 8   YearsCode                       71331 non-null  object
 9   YearsCodePro                    51833 non-null  object
 10  DevType                         61302 non-null  object
 11  OrgSize                         51039 non-null  object
 12  PurchaseInfluence               50969 non-null  object
 13  BuyNewTool                      67963 non-null  object
 14  Country                         71771 non-null  object
 15  Currency                        51264 non-null  object
 16  CompFreq                        44425 non-null  object
 17  LanguageHaveWorkedWith          70975 non-null  object
 18  LanguageWantToWorkWith          67027 non-null  object
 19  DatabaseHaveWorkedWith          60121 non-null  object
 20  DatabaseWantToWorkWith          51014 non-null  object
 21  PlatformHaveWorkedWith          49924 non-null  object
 22  PlatformWantToWorkWith          40415 non-null  object
 23  WebframeHaveWorkedWith          53544 non-null  object
 24  WebframeWantToWorkWith          46122 non-null  object
 25  MiscTechHaveWorkedWith          44992 non-null  object
 26  MiscTechWantToWorkWith          36810 non-null  object
 27  ToolsTechHaveWorkedWith         54171 non-null  object
 28  ToolsTechWantToWorkWith         46566 non-null  object
 29  NEWCollabToolsHaveWorkedWith    70347 non-null  object
 30  NEWCollabToolsWantToWorkWith    64108 non-null  object
 31  OpSysProfessional use           65503 non-null  object
 32  OpSysPersonal use               70963 non-null  object
 33  VersionControlSystem            71379 non-null  object
 34  VCInteraction                   68156 non-null  object
 35  OfficeStackAsyncHaveWorkedWith  46223 non-null  object
 36  OfficeStackAsyncWantToWorkWith  32072 non-null  object
 37  OfficeStackSyncHaveWorkedWith   62128 non-null  object
 38  OfficeStackSyncWantToWorkWith   47688 non-null  object
 39  Blockchain                      71071 non-null  object
 40  NEWSOSites                      71365 non-null  object
 41  SOVisitFreq                     70961 non-null  object
 42  SOAccount                       71572 non-null  object
 43  SOPartFreq                      58229 non-null  object
 44  SOComm                          71408 non-null  object
 45  Age                             70946 non-null  object
 46  Gender                          70853 non-null  object
 47  Trans                           70315 non-null  object
 48  Sexuality                       66565 non-null  object
 49  Ethnicity                       69474 non-null  object
 50  Accessibility                   67244 non-null  object
 51  MentalHealth                    66447 non-null  object
 52  TBranch                         52670 non-null  object
 53  ICorPM                          36283 non-null  object
 54  Knowledge_1                     35804 non-null  object
 55  Knowledge_2                     34973 non-null  object
 56  Knowledge_3                     35133 non-null  object
 57  Knowledge_4                     35097 non-null  object
 58  Knowledge_5                     35014 non-null  object
 59  Knowledge_6                     34991 non-null  object
 60  Knowledge_7                     34977 non-null  object
 61  Frequency_1                     35371 non-null  object
 62  Frequency_2                     35344 non-null  object
 63  Frequency_3                     34515 non-null  object
 64  TimeSearching                   36198 non-null  object
 65  TimeAnswering                   36022 non-null  object
 66  Onboarding                      35679 non-null  object
 67  ProfessionalTech                34906 non-null  object
 68  TrueFalse_1                     35819 non-null  object
 69  TrueFalse_2                     35715 non-null  object
 70  TrueFalse_3                     35749 non-null  object
 71  SurveyLength                    70444 non-null  object
 72  SurveyEase                      70508 non-null  object
dtypes: object(73)
memory usage: 40.8+ MB

In [123]:
df1.describe()

,ResponseId,CompTotal,VCHostingPersonal use,VCHostingProfessional use,WorkExp,ConvertedCompYearly
count,73268.000000,3.842200e+04,0.0,0.0,36769.000000,3.807100e+04
mean,36634.500000,2.342434e+52,NaN,NaN,10.242378,1.707613e+05
std,21150.794099,4.591478e+54,NaN,NaN,8.706850,7.814132e+05
min,1.000000,0.000000e+00,NaN,NaN,0.000000,1.000000e+00
25%,18317.750000,3.000000e+04,NaN,NaN,4.000000,3.583200e+04
50%,36634.500000,7.750000e+04,NaN,NaN,8.000000,6.784500e+04
75%,54951.250000,1.540000e+05,NaN,NaN,15.000000,1.200000e+05
max,73268.000000,9.000000e+56,NaN,NaN,50.000000,5.000000e+07

In [124]:
numeric_data.columns

Index(['ResponseId', 'CompTotal', 'VCHostingPersonal use',
       'VCHostingProfessional use', 'WorkExp', 'ConvertedCompYearly'],
      dtype='object')

In [125]:
df1['CompTotal'].describe()

count    3.842200e+04
mean     2.342434e+52
std      4.591478e+54
min      0.000000e+00
25%      3.000000e+04
50%      7.750000e+04
75%      1.540000e+05
max      9.000000e+56
Name: CompTotal, dtype: float64

In [135]:
df1['TrueFalse_1'].head(10)

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
6    NaN
7    NaN
8    Yes
9    NaN
Name: TrueFalse_1, dtype: object

In [132]:
updatedDf['TrueFalse_1']= df1['TrueFalse_1'].fillna(value=True)

In [133]:
updatedDf['TrueFalse_1'].head(2)

0    True
1    True
Name: TrueFalse_1, dtype: object

In [150]:
df1['TrueFalse_1'].value_counts(dropna=False,ascending=True)

TrueFalse_1
No     12052
Yes    23767
NaN    37449
Name: count, dtype: int64

In [149]:
df1['TrueFalse_1'].value_counts(dropna=False,ascending=True, normalize=True)

TrueFalse_1
No     0.164492
Yes    0.324384
NaN    0.511124
Name: proportion, dtype: float64

In [148]:
df1['TrueFalse_1'].value_counts(dropna=False,ascending=True, normalize=True)*100

TrueFalse_1
No     16.449200
Yes    32.438445
NaN    51.112355
Name: proportion, dtype: float64

In [164]:
df1['SurveyEase'].sort_values(ascending=True)

1        Difficult
68221    Difficult
26722    Difficult
18079    Difficult
18053    Difficult
           ...
73109          NaN
73157          NaN
73201          NaN
73215          NaN
73243          NaN
Name: SurveyEase, Length: 73268, dtype: object

In [173]:
df1[['WorkExp','EdLevel','MainBranch']].sort_values(by=['WorkExp'],ascending=False)

,WorkExp,EdLevel,MainBranch
66571,50.0,"Master’s degree (M.A., M.S., M.Eng., MBA, etc.)",I am a developer by profession
22751,50.0,"Other doctoral degree (Ph.D., Ed.D., etc.)","I am not primarily a developer, but I write co..."
58996,50.0,Some college/university study without earning ...,I am a developer by profession
60739,50.0,"Secondary school (e.g. American high school, G...","I used to be a developer by profession, but no..."
24950,50.0,NaN,I am a developer by profession
...,...,...,...
73256,NaN,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",I am a developer by profession
73257,NaN,"Secondary school (e.g. American high school, G...",I am learning to code
73262,NaN,"Secondary school (e.g. American high school, G...",I am learning to code
73266,NaN,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)",I am a developer by profession
73267,NaN,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","I used to be a developer by profession, but no..."

In [176]:
df1.sort_values(by=['WorkExp'],ascending=False,inplace=True)